Data In Motion Challenge Questions - Week 4 Pandas Challenge

1. See the first 10 entries.
2. Delete the columns 'Unnamed: 0' and 'Id'.
3. Group the dataset by name, assign to a variable called 4. names, and sort the dataset by highest to lowest count.
5. How many different names exist in the dataset?
6. What is the name with most occurrences?
7. What is the standard deviation of count of names?
8. Get a summary of the dataset with the mean, min, max, std and quartiles.


<i> Submission instructions:</i> Make a LinkedIn post with a screenshot or PDF of your answers and tag the Data in Motion LLC company page.

In [1]:
# Packages 

import pandas as pd
import numpy as np

In [2]:
# Importing the data

data_link = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'
df = pd.read_csv(data_link)

## Question 1 - See the first 10 entries

In [3]:
df.shape # (1016395, 5)
df.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

## Question 2 - Delete the columns 'Unnamed: 0' and 'Id'.

In [4]:
df.drop(['Unnamed: 0','Id'] ,axis=1,inplace=True)
df.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

## Question 3 - Group the dataset by name, assign to a variable called "names", and sort the dataset by highest to lowest count.

In [5]:
len(df['Name'].unique()) # Verifying number of unique names in the dataset
names = pd.pivot_table(df, values = 'Count', index = ['Name'], aggfunc=np.sum)
names = names.sort_values(by='Count',ascending=False)

print('The top 5 names are:')
names.head()

The top 5 names are:

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

## Question 4 - How many different names exist in the dataset?

In [6]:
num_names = len(df['Name'].unique())
print("There are %d different names that exist in this dataset" % num_names)

There are 17632 different names that exist in this dataset

## Question 5 - What is the name with most occurrences?

In [7]:
reocc_nam = df.groupby("Name").count().sort_values(by='Count', ascending = False)['Count'].head() # Most reoccuring name
print("%s with a total of %d had the most occurrences." % (reocc_nam.index[0], reocc_nam[0] ))

Riley with a total of 1112 had the most occurrences.

## Questions 6 - What is the standard deviation of count of names?

In [8]:
print("The standard deviation of count of names is %.3f" % df['Count'].std())

The standard deviation of count of names is 97.397

## Questions 7 - Get a summary of the dataset with the mean, min, max, std and quartiles.

In [9]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Year,1016395.0,2009.053190,3.138293,2004.0,2006.0,2009.0,2012.0,2014.0
Count,1016395.0,34.850124,97.397346,5.0,7.0,11.0,26.0,4167.0